addons/l10n_hu_edi/tests/invoice_xmls/invoice_advance.xml

<?xml version='1.0' encoding='UTF-8'?>
<InvoiceData xmlns:base="http://schemas.nav.gov.hu/OSA/3.0/base"
    xmlns:common="http://schemas.nav.gov.hu/NTCA/1.0/common"
    xmlns="http://schemas.nav.gov.hu/OSA/3.0/data"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://schemas.nav.gov.hu/OSA/3.0/data invoiceData.xsd">
    <invoiceNumber>INV/2024/00001</invoiceNumber>
    <invoiceIssueDate>2024-01-01</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <base:taxpayerId>27725414</base:taxpayerId>
                        <base:vatCode>2</base:vatCode>
                        <base:countyCode>13</base:countyCode>
                    </supplierTaxNumber>
                    <supplierName>company_1_data</supplierName>
                    <supplierAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>1073</base:postalCode>
                            <base:city>Budapest</base:city>
                            <base:additionalAddressDetail>Akácfa utca 74.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </supplierAddress>
                    <individualExemption>false</individualExemption>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <base:taxpayerId>14933477</base:taxpayerId>
                            <base:vatCode>2</base:vatCode>
                            <base:countyCode>13</base:countyCode>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>Magyar Vevő Kft.</customerName>
                    <customerAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>4000</base:postalCode>
                            <base:city>Debrecen</base:city>
                            <base:additionalAddressDetail>Alkotmány utca 11.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </customerAddress>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>NORMAL</invoiceCategory>
                    <invoiceDeliveryDate>2024-01-01</invoiceDeliveryDate>
                    <smallBusinessIndicator>false</smallBusinessIndicator>
                    <currencyCode>HUF</currencyCode>
                    <exchangeRate>1.000000</exchangeRate>
                    <paymentDate>2024-01-01</paymentDate>
                    <cashAccountingIndicator>false</cashAccountingIndicator>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <advanceData>
                        <advanceIndicator>true</advanceIndicator>
                    </advanceData>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>SERVICE</lineNatureIndicator>
                    <lineDescription>Down Payment</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>5000.000000</unitPrice>
                    <unitPriceHUF>5000.000000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>5000.00</lineNetAmount>
                            <lineNetAmountHUF>5000.00</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>1350.00</lineVatAmount>
                            <lineVatAmountHUF>1350.00</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>6350.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>6350.00</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summaryNormal>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>5000.00</vatRateNetAmount>
                            <vatRateNetAmountHUF>5000.00</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>1350.00</vatRateVatAmount>
                            <vatRateVatAmountHUF>1350.00</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <invoiceNetAmount>5000.00</invoiceNetAmount>
                    <invoiceNetAmountHUF>5000.00</invoiceNetAmountHUF>
                    <invoiceVatAmount>1350.00</invoiceVatAmount>
                    <invoiceVatAmountHUF>1350.00</invoiceVatAmountHUF>
                </summaryNormal>
                <summaryGrossData>
                    <invoiceGrossAmount>6350.00</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>6350.00</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>
