addons/l10n_hu_edi/tests/invoice_xmls/invoice_complex_eur.xml

<?xml version='1.0' encoding='UTF-8'?>
<InvoiceData xmlns:base="http://schemas.nav.gov.hu/OSA/3.0/base"
    xmlns:common="http://schemas.nav.gov.hu/NTCA/1.0/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns="http://schemas.nav.gov.hu/OSA/3.0/data"
    xsi:schemaLocation="http://schemas.nav.gov.hu/OSA/3.0/data invoiceData.xsd">
    <invoiceNumber>INV/2024/00001</invoiceNumber>
    <invoiceIssueDate>2024-02-01</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <base:taxpayerId>27725414</base:taxpayerId>
                        <base:vatCode>2</base:vatCode>
                        <base:countyCode>13</base:countyCode>
                    </supplierTaxNumber>
                    <supplierName>company_1_data</supplierName>
                    <supplierAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>1073</base:postalCode>
                            <base:city>Budapest</base:city>
                            <base:additionalAddressDetail>Akácfa utca 74.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </supplierAddress>
                    <individualExemption>false</individualExemption>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <base:taxpayerId>14933477</base:taxpayerId>
                            <base:vatCode>2</base:vatCode>
                            <base:countyCode>13</base:countyCode>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>Magyar Vevő Kft.</customerName>
                    <customerAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>4000</base:postalCode>
                            <base:city>Debrecen</base:city>
                            <base:additionalAddressDetail>Alkotmány utca 11.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </customerAddress>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>NORMAL</invoiceCategory>
                    <invoiceDeliveryDate>2024-02-01</invoiceDeliveryDate>
                    <smallBusinessIndicator>false</smallBusinessIndicator>
                    <currencyCode>EUR</currencyCode>
                    <exchangeRate>380.770000</exchangeRate>
                    <paymentMethod>TRANSFER</paymentMethod>
                    <paymentDate>2024-02-01</paymentDate>
                    <cashAccountingIndicator>false</cashAccountingIndicator>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>PRODUCT</lineNatureIndicator>
                    <lineDescription>product_a</lineDescription>
                    <quantity>3.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>10.000000</unitPrice>
                    <unitPriceHUF>3807.700000</unitPriceHUF>
                    <lineDiscountData>
                        <discountValue>6.00</discountValue>
                        <discountRate>0.2000</discountRate>
                    </lineDiscountData>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>24.00</lineNetAmount>
                            <lineNetAmountHUF>9138.48</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>6.48</lineVatAmount>
                            <lineVatAmountHUF>2467.39</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>30.48</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>11605.87</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>2</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>PRODUCT</lineNatureIndicator>
                    <lineDescription>product_b</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>OWN</unitOfMeasure>
                    <unitOfMeasureOwn>Dozens</unitOfMeasureOwn>
                    <unitPrice>19.990000</unitPrice>
                    <unitPriceHUF>7611.590000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>19.99</lineNetAmount>
                            <lineNetAmountHUF>7611.59</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>5.40</lineVatAmount>
                            <lineVatAmountHUF>2056.16</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>25.39</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>9667.75</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>3</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>SERVICE</lineNatureIndicator>
                    <lineDescription>Consultancy Service</lineDescription>
                    <quantity>2.0</quantity>
                    <unitOfMeasure>HOUR</unitOfMeasure>
                    <unitPrice>50.000000</unitPrice>
                    <unitPriceHUF>19038.500000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>100.00</lineNetAmount>
                            <lineNetAmountHUF>38077.00</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.1800</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>18.00</lineVatAmount>
                            <lineVatAmountHUF>6853.86</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>118.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>44930.86</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>4</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>SERVICE</lineNatureIndicator>
                    <lineDescription>Item without UoM</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>200.000000</unitPrice>
                    <unitPriceHUF>76154.000000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>200.00</lineNetAmount>
                            <lineNetAmountHUF>76154.00</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatExemption>
                                <case>AAM</case>
                                <reason>AAM Tax exempt</reason>
                            </vatExemption>
                        </lineVatRate>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>200.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>76154.00</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summaryNormal>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>43.99</vatRateNetAmount>
                            <vatRateNetAmountHUF>16750.07</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>11.88</vatRateVatAmount>
                            <vatRateVatAmountHUF>4522.52</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.1800</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>100.00</vatRateNetAmount>
                            <vatRateNetAmountHUF>38077.00</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>18.00</vatRateVatAmount>
                            <vatRateVatAmountHUF>6853.86</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <summaryByVatRate>
                        <vatRate>
                            <vatExemption>
                                <case>AAM</case>
                                <reason>AAM Tax exempt</reason>
                            </vatExemption>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>200.00</vatRateNetAmount>
                            <vatRateNetAmountHUF>76154.00</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>0.00</vatRateVatAmount>
                            <vatRateVatAmountHUF>0.00</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <invoiceNetAmount>343.99</invoiceNetAmount>
                    <invoiceNetAmountHUF>130981.07</invoiceNetAmountHUF>
                    <invoiceVatAmount>29.88</invoiceVatAmount>
                    <invoiceVatAmountHUF>11376.38</invoiceVatAmountHUF>
                </summaryNormal>
                <summaryGrossData>
                    <invoiceGrossAmount>373.87</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>142357.45</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>