addons/l10n_hu_edi/tests/invoice_xmls/invoice_complex_huf.xml

<?xml version='1.0' encoding='UTF-8'?>
<InvoiceData xmlns:base="http://schemas.nav.gov.hu/OSA/3.0/base"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns="http://schemas.nav.gov.hu/OSA/3.0/data"
    xmlns:common="http://schemas.nav.gov.hu/NTCA/1.0/common"
    xsi:schemaLocation="http://schemas.nav.gov.hu/OSA/3.0/data invoiceData.xsd">
    <invoiceNumber>INV/2024/00001</invoiceNumber>
    <invoiceIssueDate>2024-02-01</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <base:taxpayerId>27725414</base:taxpayerId>
                        <base:vatCode>2</base:vatCode>
                        <base:countyCode>13</base:countyCode>
                    </supplierTaxNumber>
                    <supplierName>company_1_data</supplierName>
                    <supplierAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>1073</base:postalCode>
                            <base:city>Budapest</base:city>
                            <base:additionalAddressDetail>Akácfa utca 74.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </supplierAddress>
                    <supplierBankAccountNumber>HU0123456789</supplierBankAccountNumber>
                    <individualExemption>false</individualExemption>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <base:taxpayerId>14933477</base:taxpayerId>
                            <base:vatCode>2</base:vatCode>
                            <base:countyCode>13</base:countyCode>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>Magyar Vevő Kft.</customerName>
                    <customerAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>4000</base:postalCode>
                            <base:city>Debrecen</base:city>
                            <base:additionalAddressDetail>Alkotmány utca 11.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </customerAddress>
                    <customerBankAccountNumber>HU6666666666</customerBankAccountNumber>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>NORMAL</invoiceCategory>
                    <invoiceDeliveryDate>2024-02-01</invoiceDeliveryDate>
                    <smallBusinessIndicator>false</smallBusinessIndicator>
                    <currencyCode>HUF</currencyCode>
                    <exchangeRate>1.000000</exchangeRate>
                    <paymentMethod>TRANSFER</paymentMethod>
                    <paymentDate>2024-02-01</paymentDate>
                    <cashAccountingIndicator>false</cashAccountingIndicator>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>PRODUCT</lineNatureIndicator>
                    <lineDescription>product_a</lineDescription>
                    <quantity>3.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>10.000000</unitPrice>
                    <unitPriceHUF>10.000000</unitPriceHUF>
                    <lineDiscountData>
                        <discountValue>6.00</discountValue>
                        <discountRate>0.2000</discountRate>
                    </lineDiscountData>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>24.00</lineNetAmount>
                            <lineNetAmountHUF>24.00</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>6.48</lineVatAmount>
                            <lineVatAmountHUF>6.48</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>30.48</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>30.48</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>2</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>PRODUCT</lineNatureIndicator>
                    <lineDescription>product_b</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>OWN</unitOfMeasure>
                    <unitOfMeasureOwn>Dozens</unitOfMeasureOwn>
                    <unitPrice>19.990000</unitPrice>
                    <unitPriceHUF>19.990000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>19.99</lineNetAmount>
                            <lineNetAmountHUF>19.99</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>5.40</lineVatAmount>
                            <lineVatAmountHUF>5.40</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>25.39</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>25.39</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>3</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>SERVICE</lineNatureIndicator>
                    <lineDescription>Consultancy Service</lineDescription>
                    <quantity>2.0</quantity>
                    <unitOfMeasure>HOUR</unitOfMeasure>
                    <unitPrice>50.000000</unitPrice>
                    <unitPriceHUF>50.000000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>100.00</lineNetAmount>
                            <lineNetAmountHUF>100.00</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.1800</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>18.00</lineVatAmount>
                            <lineVatAmountHUF>18.00</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>118.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>118.00</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>4</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>SERVICE</lineNatureIndicator>
                    <lineDescription>Item without UoM</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>200.000000</unitPrice>
                    <unitPriceHUF>200.000000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>200.00</lineNetAmount>
                            <lineNetAmountHUF>200.00</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatExemption>
                                <case>AAM</case>
                                <reason>AAM Tax exempt</reason>
                            </vatExemption>
                        </lineVatRate>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>200.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>200.00</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>5</lineNumber>
                    <lineExpressionIndicator>false</lineExpressionIndicator>
                    <lineNatureIndicator>OTHER</lineNatureIndicator>
                    <lineDescription>Rounding to 1.00</lineDescription>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>0.13</lineNetAmount>
                            <lineNetAmountHUF>0.13</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatOutOfScope>
                                <case>ATK</case>
                                <reason>ATK Outside the scope of VAT - VAT tv.2-3.§</reason>
                            </vatOutOfScope>
                        </lineVatRate>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>0.13</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>0.13</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summaryNormal>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.2700</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>43.99</vatRateNetAmount>
                            <vatRateNetAmountHUF>43.99</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>11.88</vatRateVatAmount>
                            <vatRateVatAmountHUF>11.88</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.1800</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>100.00</vatRateNetAmount>
                            <vatRateNetAmountHUF>100.00</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>18.00</vatRateVatAmount>
                            <vatRateVatAmountHUF>18.00</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <summaryByVatRate>
                        <vatRate>
                            <vatExemption>
                                <case>AAM</case>
                                <reason>AAM Tax exempt</reason>
                            </vatExemption>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>200.00</vatRateNetAmount>
                            <vatRateNetAmountHUF>200.00</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>0.00</vatRateVatAmount>
                            <vatRateVatAmountHUF>0.00</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <summaryByVatRate>
                        <vatRate>
                          <vatOutOfScope>
                            <case>ATK</case>
                            <reason>ATK Outside the scope of VAT - VAT tv.2-3.§</reason>
                          </vatOutOfScope>
                        </vatRate>
                        <vatRateNetData>
                          <vatRateNetAmount>0.13</vatRateNetAmount>
                          <vatRateNetAmountHUF>0.13</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                          <vatRateVatAmount>0.00</vatRateVatAmount>
                          <vatRateVatAmountHUF>0.00</vatRateVatAmountHUF>
                        </vatRateVatData>
                      </summaryByVatRate>
                      <invoiceNetAmount>344.12</invoiceNetAmount>
                    <invoiceNetAmountHUF>344.12</invoiceNetAmountHUF>
                    <invoiceVatAmount>29.88</invoiceVatAmount>
                    <invoiceVatAmountHUF>29.88</invoiceVatAmountHUF>
                </summaryNormal>
                <summaryGrossData>
                    <invoiceGrossAmount>374.00</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>374.00</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>