addons/l10n_hu_edi/tests/invoice_xmls/invoice_tax_price_include.xml

<?xml version='1.0' encoding='UTF-8'?>
<InvoiceData xmlns:common="http://schemas.nav.gov.hu/NTCA/1.0/common" xmlns:base="http://schemas.nav.gov.hu/OSA/3.0/base" xmlns="http://schemas.nav.gov.hu/OSA/3.0/data" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.nav.gov.hu/OSA/3.0/data invoiceData.xsd">
    <invoiceNumber>INV/2024/00001</invoiceNumber>
    <invoiceIssueDate>2024-02-01</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <base:taxpayerId>27725414</base:taxpayerId>
                        <base:vatCode>2</base:vatCode>
                        <base:countyCode>13</base:countyCode>
                    </supplierTaxNumber>
                    <supplierName>company_1_data</supplierName>
                    <supplierAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>1073</base:postalCode>
                            <base:city>Budapest</base:city>
                            <base:additionalAddressDetail>Ak&#225;cfa utca 74.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </supplierAddress>
                    <individualExemption>false</individualExemption>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <base:taxpayerId>14933477</base:taxpayerId>
                            <base:vatCode>2</base:vatCode>
                            <base:countyCode>13</base:countyCode>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>Magyar Vev&#337; Kft.</customerName>
                    <customerAddress>
                        <base:simpleAddress>
                            <base:countryCode>HU</base:countryCode>
                            <base:postalCode>4000</base:postalCode>
                            <base:city>Debrecen</base:city>
                            <base:additionalAddressDetail>Alkotm&#225;ny utca 11.</base:additionalAddressDetail>
                        </base:simpleAddress>
                    </customerAddress>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>NORMAL</invoiceCategory>
                    <invoiceDeliveryDate>2024-02-01</invoiceDeliveryDate>
                    <smallBusinessIndicator>false</smallBusinessIndicator>
                    <currencyCode>HUF</currencyCode>
                    <exchangeRate>1.000000</exchangeRate>
                    <paymentDate>2024-02-01</paymentDate>
                    <cashAccountingIndicator>false</cashAccountingIndicator>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>PRODUCT</lineNatureIndicator>
                    <lineDescription>product_a</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>769.230000</unitPrice>
                    <unitPriceHUF>769.230000</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>769.23</lineNetAmount>
                            <lineNetAmountHUF>769.23</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.3000</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>230.77</lineVatAmount>
                            <lineVatAmountHUF>230.77</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>1000.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>1000.00</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>2</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineNatureIndicator>PRODUCT</lineNatureIndicator>
                    <lineDescription>product_a</lineDescription>
                    <quantity>1.0</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>769.225000</unitPrice>
                    <unitPriceHUF>769.230000</unitPriceHUF>
                    <lineDiscountData>
                        <discountValue>153.85</discountValue>
                        <discountRate>0.2000</discountRate>
                    </lineDiscountData>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>615.38</lineNetAmount>
                            <lineNetAmountHUF>615.38</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.3000</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>184.62</lineVatAmount>
                            <lineVatAmountHUF>184.62</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>800.00</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>800.00</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summaryNormal>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.3000</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>1384.61</vatRateNetAmount>
                            <vatRateNetAmountHUF>1384.61</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>415.38</vatRateVatAmount>
                            <vatRateVatAmountHUF>415.38</vatRateVatAmountHUF>
                        </vatRateVatData>
                    </summaryByVatRate>
                    <invoiceNetAmount>1384.62</invoiceNetAmount>
                    <invoiceNetAmountHUF>1384.62</invoiceNetAmountHUF>
                    <invoiceVatAmount>415.38</invoiceVatAmount>
                    <invoiceVatAmountHUF>415.38</invoiceVatAmountHUF>
                </summaryNormal>
                <summaryGrossData>
                    <invoiceGrossAmount>1800.00</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>1800.00</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>
